In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#타이타닉 불러오기
titanic_df =sns.load_dataset('titanic')
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
#사용할 데이터 복제
tdf = titanic_df.copy()
tdf.sex.value_counts() #값 개수 확인

male      577
female    314
Name: sex, dtype: int64

In [4]:
#그룹
sex = tdf.groupby('sex').count()
sex

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [5]:
#함수 mapping -- groupby와 lambda를 같이 사용.
tdf.groupby('sex').apply(lambda x:x.count())[['survived']]

        survived
sex
female       314
male         577

In [6]:
#sibsp , parch 에 1을 더하기 (lambda)
te = tdf[['sibsp','parch']].apply(lambda x : x+1)
te.head()

   sibsp  parch
0      2      1
1      2      1
2      1      1
3      2      1
4      1      1

In [23]:
#대문자화 시키기 
def uppercase(x):
    return x.upper()

tdf.sex.apply(uppercase)[0:2] #Series -- 사용자함수 바로 적용

0      MALE
1    FEMALE
Name: sex, dtype: object

In [8]:
# Age column을 범주화하여 age_class 컬럼을 생성하세요
len(tdf.age.unique())
#categorization : 범주화 필수

89

In [9]:
tdf['age'] = tdf['age'].fillna(tdf['age'].mean().round(0)) 
#nan값을 평균값으로 대체

# 평균값으로 하기엔 너무 근거가 없음

In [10]:
def categorization_age(x):
    cat = ''      #category 지정
    if x < 10: 
        cat ="children"
    elif 10<= x <20 : 
        cat = "teen"
    elif 21<= x <40 : 
        cat ="young_adults"
    elif 40<= x <59 :  
        cat = "adults"
    else: 
        cat = "senior"
    return cat
#함수설정

In [11]:
#데이터프레임 열에 함수를 적용
ag = tdf.age.apply(lambda x : categorization_age(x))
tdf['age_class'] = ag

In [12]:
#함수확인
print(tdf[['age','age_class']])
tdf['age_class'].value_counts()

      age     age_class
0    22.0  young_adults
1    38.0  young_adults
2    26.0  young_adults
3    35.0  young_adults
4    35.0  young_adults
..    ...           ...
886  27.0  young_adults
887  19.0          teen
888  30.0  young_adults
889  26.0  young_adults
890  32.0  young_adults

[891 rows x 2 columns]

young_adults    548
adults          135
teen            102
children         62
senior           44
Name: age_class, dtype: int64

In [13]:
# 'survived','pclass','sex'컬럼으로 df1을 생성
df1 = tdf[['survived','pclass','sex']]
#df1에서 pclass가 3인 승객의 개수를 구하세요.

In [14]:
df1

     survived  pclass     sex
0           0       3    male
1           1       1  female
2           1       3  female
3           1       1  female
4           0       3    male
..        ...     ...     ...
886         0       2    male
887         1       1  female
888         0       3  female
889         1       1    male
890         0       3    male

[891 rows x 3 columns]

In [15]:
print(len(df1.query('pclass==3')))

491

In [16]:
len(list(filter(lambda x:x ==3, df1.pclass)))

491

In [17]:
tdf.embark_town.isnull().sum()

2

Q. embark_town열의 NaN 값을 바로 앞에 있는 값으로 변경하세요

In [18]:
#tdf.embark_town = tdf.embark_town.fillna( method = 'ffill',inplace=True) front_fill
rows_with_nan = [index for index, row in tdf[['embark_town']].iterrows() if row.isnull().any()]
rows_with_nan

[61, 829]

In [19]:
tdf['embark_town'][]

SyntaxError: invalid syntax (<ipython-input-19-ee3a8f920676>, line 1)

In [ ]:
# df1['pclass'].filter()
# 데이터프레임에 바로 filter를 적용하는 법 찾아보기
# 데이터프레임 그룹바이 안에 조건을 적용하는법 찾아보기

##### FiFA

In [ ]:
fifa = pd.read_csv('../Data/FIFA.csv')
fifa.head()

In [ ]:
fd = fifa.copy()

In [ ]:
#height의 값을 cm로 변환하여 새로운 컬럼을 생성하세요

In [ ]:
#문자열  -> split -> index별로 바꾸고 -> 둘이 더한 값을 빼냄

In [ ]:
def t_cm(x):
    a,b = map(int,x.split("'")) # ' 문자열 그대로 받아오기 \' (" ' ") -> 크게 상관x
    return a*30.48 + b*2.54
fd['Height_cm'] = fd.Height.apply(lambda x: t_cm(x))
fd.head()

#### Wage를 예측하는 모델을 만들어라

In [ ]:
fd.info()
#work_rate : ??
#Release_Claues : ?
print(fd.isnull().sum().sum()) #결측값 없음.

#필요없는 column  == Nationality / Jersey_Number /ID
#type변경 == Foot/Work_Rate / Position 
#수치 변겨 = Weight_lb

In [ ]:
fd.corr()